app/views/events/_form.html.erb

SELECT "places".* FROM "places"
---
    <%= form.label :place_id %>
    <%= form.select :place_id, Place.all.map {|p| [p.name, p.id]} %>