app/views/tickets/_form.html.erb

SELECT "events".* FROM "events"
---
    <%= form.label :event_id %>
    <%= form.select :event_id, Event.all.map{ |p| [p.name, p.id] } %>