app/controllers/cart_controller.rb

SELECT "user_tickets".* FROM "user_tickets" WHERE "user_tickets"."user_id" = ? AND "user_tickets"."paid" = ?  [["user_id", 6], ["paid", "f"]]
---
  def index
    @user_tickets = UserTicket.where(user_id: current_user.id, paid: false)

SELECT "user_tickets".* FROM "user_tickets" WHERE "user_tickets"."user_id" = ? AND "user_tickets"."paid" = ?  [["user_id", 6], ["paid", "f"]]
SELECT  "tickets".* FROM "tickets" WHERE "tickets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "user_tickets" SET "paid" = ?, "updated_at" = ? WHERE "user_tickets"."id" = ?  [["paid", "t"], ["updated_at", "2019-05-24 01:46:18.587902"], ["id", 18]]
---
  def pay
    @total = 0
    @paid_tickets = UserTicket.where(user_id: current_user.id, paid: false)
    @paid_tickets_l = UserTicket.where(user_id: current_user.id, paid: false).length
    @tickets_info = Array.new
    if @paid_tickets_l > 0
      @paid_tickets.each do |user_ticket|
        user_ticket.update(paid: true)