app/controllers/events_controller.rb

  def show
    @tickets = Ticket.where(event_id:@event.id)
---
SELECT "tickets".* FROM "tickets" WHERE "tickets"."event_id" = ?  [["event_id", 1]]

  def create
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save
---
INSERT INTO "events" ("name", "description", "start_date", "place_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "23456"], ["description", "34567"], ["start_date", "2019-05-23"], ["place_id", 1], ["created_at", "2019-05-23 22:13:05.983571"], ["updated_at", "2019-05-23 22:13:05.983571"]]

  def update
    respond_to do |format|
      if @event.update(event_params)
---
UPDATE "events" SET "description" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["description", "YEs Yes"], ["updated_at", "2019-05-24 00:00:37.929347"], ["id", 1]]