app/controllers/tickets_controller.rb

  def create
    @ticket = Ticket.new(ticket_params)

    respond_to do |format|
      if @ticket.save
---
INSERT INTO "tickets" ("price", "event_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["price", 3456], ["event_id", 1], ["created_at", "2019-05-23 22:04:08.054169"], ["updated_at", "2019-05-23 22:04:08.054169"]]