app/controllers/user_tickets_controller.rb

SELECT "user_tickets".* FROM "user_tickets"
---
  def index
    @user_tickets = UserTicket.all

INSERT INTO "user_tickets" ("user_id", "ticket_id", "time", "paid", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 4], ["ticket_id", 1], ["time", "2019-05-23 23:28:47.879126"], ["paid", "f"], ["created_at", "2019-05-23 23:28:47.883394"], ["updated_at", "2019-05-23 23:28:47.883394"]]
---
  def create
    @user_ticket = UserTicket.new(user_ticket_params)
    @user_ticket.time = Time.now
    @user_ticket.paid = false
    respond_to do |format|
      if @user_ticket.save

DELETE FROM "user_tickets" WHERE "user_tickets"."id" = ?  [["id", 19]]
---
  def destroy
    @user_ticket.destroy

SELECT  "user_tickets".* FROM "user_tickets" WHERE "user_tickets"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]
---
    def set_user_ticket
      @user_ticket = UserTicket.find(params[:id])